{"_id":{"$oid":"6029e7ff630fd9c50fe518d1"},"title":"MainText","content":"This is the personal Website for Owen Zhang. owen_zzz@hotmail.com","type":"static"}
{"_id":{"$oid":"6031d5ef2a6ff116acd21e67"},"title":"Pass","password":"alexander","type":"static","name":"Johnny"}
{"_id":{"$oid":"6045630a4692ba162c36ee74"},"title":"Perhaps its not worth it","content":"dfdfd","type":"Fire","date":"2021-03-07 18:34:33"}
{"_id":{"$oid":"604eb8a42e40d92ef890f209"},"title":"this is the first entry","content":"Add the ability to more the full textarea","type":"Fire","date":"2021-03-14 21:30:11"}
{"_id":{"$oid":"604edd478f140e000ff59ffa"},"title":"Journey into the modern WebDev","content":"This website has been an attempt to get familiar with creating a somewhat modern website, with all the fancy packages and methodologies. It's using the Nuxt framework which compiles various packages together (VueJS, Vuetify, NodeJS ...) and stores data on MongoDB. \n\nI've always been pretty scared of delving into webdev, from the outside it seems like a never-ending well of knowledge domains, and over-complicated and over-engineered solutions to simple problems. This has certainly been my case when making this app. I tried to keep extra package dependencies to a minimum, as it seems like everything is stitched together, I'm imagining a rickety house on an unstable foundation.\nI think it's pretty akin to using a game engine, where there are many conveniences afforded to you at the cost of hiding the underlying workings. It can do straightforward things very quickly, however if you need a specific feature, you'll end up fighting with the engine to get things done. You have to figure out the black box, and massage it to do what you want. The added complexity with web frameworks is the multitude of third party packages to choose from, it isn't like a game engine in that regard since it doesn't give you everything from the start. \nAll this is baffling since the reason for using a game engine is helping with the complexity involved in creating 3D games, all the matrix mathematics, quaternions, rendering involved. \nHowever what we're primarily dealing with when creating websites is text. Delivering text shouldn't be so complicated.","type":"Fire","date":"2021-03-15 4:6:31"}
{"_id":{"$oid":"60564b6276bf09000f3d8aec"},"title":"Jason Rohrer pokes the bear","content":"Recently the indie dev Jason Rohrer, creator of the game Passage and most recently One Hour One Life, has been in a bit of a doozy. He's selling artwork without the artist's consent via a method that damages the environment. That's a pretty shocking turn of events from someone much adored for his indie game trailblazing. But maybe that statement tells us more about the surrounding media climate rather than the truth.\nExample 1:\nhttps://kotaku.com/game-artists-not-happy-that-developer-is-selling-their-1846465316\n\nWhat is actually happening is that he's selling digital signatures for pieces of public domain pixel art that he commissioned for the game Castle Doctrine. This the most recent blockchain craze called NFTs (non-fungible tokens) whereby people are able to create unalterable strings containing metadata to something, these can be licenses to physical things such as serial codes of baseball cards, in this case it was an url to a page hosting the .jpg images. They are then auctioning off these essentially worthless things to try to make a quick buck. In short Jason Rohrer is poking fun, and perhaps also trying to cash in on this. To me, it feels like just a silly joke that's in part commentary on people's notion of value, which kind of also fits into the original game, Castle Doctrine, which is about breaking and entering and stealing things. A small thing about an ethical gray area with no ill intent.\nSome people are having a problem with how much power is required for the ethereum blockchain whereby these NFTs are traded. But who's to say what has value. The other issue is accreditation and selling other people's artwork without their knowledge. That gets a bit more complicated, if I were to commission a piece of work from you, do you have a say in what I do with it? Don't I now own it? In any case it was an oversight on Jason Rohrer's part in not asking the original artists for their consent to participate in the joke, he's since removed any unhappy participants.\n\nThis is interesting and got me to look at the twitter flame war that broke out due to this:\nhttps://twitter.com/jasonrohrer/status/1369331652787400704\n\nLot's of virtue signalling and shaming for what I think to be a pretty innocuous thing. This eventually led me to another, perhaps more serious turn of events that occurred surrounding his other game One Hour One Life, a tale of fraud, personal principles being tested, and a ripoff being more popular than the original :\nhttps://onehouronelife.com/forums/viewtopic.php?id=2106\nhttps://onehouronelife.com/forums/viewtopic.php?id=5479\nhttps://onehouronelife.com/forums/viewtopic.php?pid=48614#p48614\n\nLet me try to summarize. Jason Rohrer is a pretty peculiar individual, he puts all his games into the public domain. What this means is that all the source code, art is publicly available with no copyright:\nhttps://github.com/jasonrohrer\nThis is pretty problematic especially if you're trying to sell your works. However he is steadfast in his beliefs, which is outlined here:\nhttp://hcsoftware.sourceforge.net/jason-rohrer/freeDistribution.html\nIt's pretty admirable, if not a bit naive. But it works for him. One Hour One Life was able to turn a profit by selling accounts with access to the server where he's hosting the game. Since that's the official server and it's an MMO game, the account is pretty much required for you to play the game. But that doesn't stop anyone else from hosting a server and charging for access. What happened was someone saw an opportunity and ported the game for mobile, which became more popular than the original game. The mobile developers were pretty transparent with Jason from the onset, however when they release the game in China there was no attribution to the original game by the publisher, which along with more people actually playing in China than those that played the original game resulted in the majority of people's first hand experience with the game being not the original vision Jason intended. \nArguments were slung back and forth in the forums, however due to the public domain nature of the IP, there was no legal recourse Jason could take. And he didn't want to anyways. The sum of which is this post:\n\nThis has been going on for more than four days, and I have more pressing matters to attend to (family, GDC talk, more OHOL updates).  So, at this point, I guess I give up.\n\nI have withdrawn my dispute submissions from Apple, Google, and TapTap.\n\nI feel like a great deal of damage has already been done to my legacy and reputation as a designer, and an unfathomable amount of additional damage will be done in the future, if the current course with the mobile adaptation isn't altered.  I can imagine a situation in the future where OHOL becomes widely known, but the vast majority of people in the world mistakenly believe that the mobile version is the original version, and that DualDecade alone authored it, or that I am part of DualDecade, and that I approved the changes that they have made.  If that comes to pass, that situation will haunt me for the rest of my life.  We're pretty close to that already, at least in China and Japan.\n\nOne Hour One Life is the biggest project that I've ever worked on, and the one that I'm most proud of, and also the most personal.  My pen-and-ink drawings, my watercolor backgrounds, my characters, my voice making all the sounds, and my soul poured into the piano music, which I improvised in one take, directly from the heart.  A love letter to the world and to humanity, from where I sit at age 41, half-way through my life, as my three boys transform into men right before my eyes, and as I pass from being the main character in my own story to a supporting role in the stories of other people.\n\nYou can all understand how terrible it is for anyone out there who plays and enjoys the game to not understand where the game came from, or think that other people made it, or think that I put Santa Claus in it.\n\nThat said, I don't think copyright is the right tool to prevent such harms.  The truth does not expire after limited terms.  The truth doesn't change or become irrelevant 70 years after the death of the author.  The truth doesn't need copyright.  The truth just needs people who are willing to tell it.\n\nThe truth now, for whoever is willing to tell it, is that the mobile version has gone from \"unofficial and not specifically approved\" to \"specifically unapproved and directly against my wishes as the original creator,\" only because of the way that its presentation has misled people in the past, and will continue to mislead people in the future, in its current form.\n\nHopefully, Christoffer, you will be willing to correct this, and prevent additional harm to my legacy, in a way that you can live with.\n\nI've given you four years of my life and creative output, allowed you to build a successful commercial product using that output, and asked for nothing in return.  Nothing but the truth.  That's on you now.\n\nBut as for me, I'm out.\n\n\n\n","type":"Fire","date":"2021-03-20 19:22:9"}
{"_id":{"$oid":"60580c0b5c56cf000f5aca8c"},"title":"Chris Crawford give up, the futility of interactive storytelling","content":"http://www.erasmatazz.com/library/interactive-storytelling/why-i-am-ending-further.html\nPioneer of GDC and game as an artform herald quits making interactive fiction, his life's work. ","type":"Fire","date":"2021-03-22 3:16:27"}
{"_id":{"$oid":"60581cedf28095000fe4f16d"},"title":"Gamedev Dogmas","content":"I am by no means a professional game developer in any capacity, but I do take games as a medium seriously. I thought it might be fun to have a discussion on a list of rules that are the gamedev equivalent of Dogme 95.\n\nThe original Dogme 95 was to try to take back the artistry of film from the studio to the directors. There was the idea that films are too focused on big budgets and special effects in lieu of storytelling and craft. These rules try to get at the heart of films, stripping away its excesses. https://en.wikipedia.org/wiki/Dogme_95\n\nThese rules should try to do the same. Establish extremes which puts the artistry back into games. These should be rules which try to narrow the focus of games, eliminating need for large budgets and cutting edge tech. I’m not sure if there should be limits on which types of games shouldn’t be made, things like no open world games are too general, although I would like there to be rules which limits the scope of the game. There can’t be too many mechanics in a game which can dilute its meaning. But I’m not sure how to formulate it as a rule.\n\nThese are a few I’ve come up with so far:\n\n    No use of superficial violence as a core mechanic. Things like shooting, fighting, commanding units to attack. Core mechanic meaning it is a primary gameplay loop that the player engages with throughout the game. (Maybe there should be a rule where you have to focus on realism, it doesn’t make sense to have the player character kill thousands in a playthrough. That person doesn’t exist).\n\n    Released games must contain all elements, no post release content (i.e. expansion packs). Things like patches for bug fixes are allowed but must not modify the game in any way that differs from the intended vision. I.e. you can’t change a game mechanic post release because you’ve found a better method. (Maybe this should be more flexible for episodic content).\n\n    No mechanics which requires payment post release (i.e. no microtransactions).\n\n    All game code must be open source, and publicly available. (you might say no one will pay for the game in that case, but I think the educational benefits outweigh the profit loss, it’ll be pirated anyways, and compiling the game isn’t a small task).\n\n    If the game has a narrative, there must be at least one mechanic that is at least loosely related to it. (Ludo narrative harmony, although this rule might be too restrictive, and has the capacity to be pretentious).\n\n    The game must have a mechanic outside of just walking and reading (i.e. no walking simulators, but this rule might run counter to the purpose of these rules).\n\nReally, these are just things I’d like to see more in games.\n","type":"Fire","date":"2021-03-22 4:28:29"}
{"_id":{"$oid":"605ad19a14e535000f25e453"},"title":"Chris Crawford's Vision into the Heavens","content":"http://www.erasmatazz.com/library/interactive-storytelling/references-for-wumpus.html\nHe goes much more in depth into what I was thinking of initially when trying to create meaningful interactions in games. You quickly reach a wall when trying to make choices matter, the decision tree becomes unmanageable, it's an exponential increase. That's where I stopped, and that's where Chris pushed on.\nhttp://www.erasmatazz.com/library/interactive-storytelling/encounter-system-technology/architecture-of-encounter.html\nIt's very laudable, and the solution he proposes is pretty interesting, an encounter based system of randomly allowing the user to choose between a set of events, with a global variable to keep track of allowed next states. I would like to create something with that architecture with some simple graphics.\nI have solutions to two problems:\nCode Architecture -> ECS\nStory Architecture -> Chris' Encounter system.\nThis feel like the start of my next project.\nReading on however it's super interesting, and a bit depressing to see the lack of widespread knowledge of Chris' work. The industry doesn't even care about these issues in game design. I think it's partially Chris' fault, looking at his past projects and Wumpus 0.87, they've been highly inaccessible. He's trying to create a story telling engine, then trying to get people to use it, without creating anything meaningful in it in the first place. It's all theory and no practice, which I guess is why the mainstream hasn't cared.\nThere's a feeling of pathos when looking back at his famous dragon speech, then reading his I'm giving up post. Keep on pushing Chris, your work is important.\n","type":"Fire","date":"2021-03-24 5:43:54"}
{"_id":{"$oid":"605b6d8bcfe227000fe802ff"},"title":"Game Idea: Crawford's Dragon","content":"A game about ambition, dreams and the struggle to fulfill. Using Chris' allegory of the dragon as the ultimate goal of game design, create a standard story about a knight slaying a dragon. Use Chris' theory on interactive storytelling to portray different events occurring in the story, with the ultimate outcome being dragon slayed or not. Interestingly, Chris is actually creating a similar game about King Arthur's battle with Mordred.\nA series of short encounters with different individuals which you must recruit in your battle against the 'Dragon'. Some questioning why the dragon needs to be fought in the first place. Some complacent in the dragonness way of life.\n\nDragon as an allegory for the evil that is holding back game design in Chris' goal?\nChris must find the holy sword (answer in game design) to defeat the Dragon.\nPeople complacent with the way the Dragon is wrecking havoc on.\n\nEach person the knight talks to has to be representative of an aspect of the gamedev community. Doubters, supporters? The concept of ennui?\nThree encounters?\n\nIn a faraway land, there was a mythical dragon that mostly kept to itself. Maybe the holy grail would be a more apt metaphor to the goal of interactive story design. Instead of a dragon that's wrecking havoc. The dragon can be one of the encounters blocking the way to the Grail. But maybe the Grail metaphor would be too on the nose. Dragon sounds cooler and there's the death analogy.\n\nIn a faraway land, there was a mythical Dragon that terrorized the town. However the townsfolk didn't feel terrorized, this was because the Dragon was so horrible and ever present that people just ignored it. So awful was its presence that most people didn't even realize the extent that the Dragon affected their daily lives. They just carried on as if it wasn't the most terrible travesty that befell the lands.\n\nWho doesn't see and Crawford needs to convince?\nThe industry (creators?), the gamer, the artist?\nIt's corollary to medieval\nThe blacksmith, the townsfolk, the king?\nWho would be the king in the real world. Industry? \n","type":"Fire","date":"2021-03-24 16:49:15"}
{"_id":{"$oid":"606e1422d204e7000f359071"},"title":"Interactive Narrative Design","content":"CC proposes a system of random next dialog choices depending on character favorability towards the player character. It seems like a tiered system of various dialog path unlocks.\nExample:\nCharacter Favorability towards player: 0\nTwo choices to increase or decrease value.\nX number of reactions depending on favorability (here is where it is randomized, but accounting for weight factor)\nThe reactions lead to next step in dialog. Rinse and repeat till terminal message.\n\nDialog 1 -> Choice A (+1), Choice B (-1), Choice C(0)\nReaction 1 (%50 probability + favorability) -> Dialog 2\nReaction 2 (%50 probability - favorability) -> Dialog 3\n\nWhich repeats until end dialog.\n\nIt can still be a lot of dialog trees to design over, and if each choice results in two reactions leading to two different dialogs, it'll still unmaintainable exponential growth. The elegance here is that the player is able to select factors which can impact outcomes, however ultimately it's still mostly a linear experience.\n\n\n","type":"Fire","date":"2021-04-07 20:20:50"}
